In [1]:
#Install packages
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass
password = getpass.getpass()

 ········

# 1. Establish a connection between Python and the Sakila database.

In [4]:
#Creating an engine
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

# 2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame.

In [23]:
from sqlalchemy import text

def rentals_month(engine, month, year): 
    month = int(month) 
    year = int(year)
    query = text(""" SELECT * FROM rental WHERE MONTH(rental_date) = :month AND YEAR(rental_date) = :year """)
    with engine.connect() as connection: df = pd.read_sql(query, connection, params={"month": month, "year": year}) 
    return df

In [35]:
rentals_df = rentals_month(engine, 2, 2006)
rentals_df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,11496,2006-02-14 15:16:03,2047,155,None,1,2006-02-15 21:30:53
1,11541,2006-02-14 15:16:03,2026,335,None,1,2006-02-15 21:30:53
2,11563,2006-02-14 15:16:03,1545,83,None,1,2006-02-15 21:30:53
3,11577,2006-02-14 15:16:03,4106,219,None,2,2006-02-15 21:30:53
4,11593,2006-02-14 15:16:03,817,99,None,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
177,15862,2006-02-14 15:16:03,925,215,None,1,2006-02-15 21:30:53
178,15867,2006-02-14 15:16:03,837,505,None,2,2006-02-15 21:30:53
179,15875,2006-02-14 15:16:03,3611,41,None,1,2006-02-15 21:30:53
180,15894,2006-02-14 15:16:03,4416,168,None,1,2006-02-15 21:30:53
181,15966,2006-02-14 15:16:03,4472,374,None,1,2006-02-15 21:30:53

# 3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

In [43]:
def rental_count_month(df, month, year):
    rental_counts = df.groupby('customer_id').size().reset_index(name=f'rentals_{month:02d}_{year}')
    return rental_counts

In [47]:
rentals_count_df = rental_count_month(rentals_df, 3, 2006)
rentals_count_df

     customer_id  rentals_02_2006
0              5                1
1              9                1
2             11                1
3             14                1
4             15                2
..           ...              ...
153          587                1
154          590                1
155          592                1
156          596                1
157          597                1

[158 rows x 2 columns]

# Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [55]:
def compare_rentals(df1, df2, month_1, year_1, month_2, year_2):
    merged_df = pd.merge(df1, df2, on = 'customer_id', how = 'outer')
    merged_df['difference'] = merged_df[f'rentals_{month_1:02d}_{year_1}'] - merged_df[f'rentals_{month_2:02d}_{year_2}']
    return merged_df

In [61]:
rental_df_1 = rental_count_month(rentals_df, 5, 2005)
rental_df_2 = rental_count_month(rentals_df, 3, 2006)

In [62]:
compare_rentals(rental_df_1, rental_df_2, 5, 2005, 3, 2006)

     customer_id  rentals_05_2005  rentals_03_2006  difference
0              5                1                1           0
1              9                1                1           0
2             11                1                1           0
3             14                1                1           0
4             15                2                2           0
..           ...              ...              ...         ...
153          587                1                1           0
154          590                1                1           0
155          592                1                1           0
156          596                1                1           0
157          597                1                1           0

[158 rows x 4 columns]